Revit 2024 API
IFCFileModelOptions Class
 This class contains options to create an IFC file model.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class IFCFileModelOptions : IDisposable
Visual Basic
Public Class IFCFileModelOptions _
	Implements IDisposable
Visual C++
public ref class IFCFileModelOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCFileModelOptions
See Also
IFCFileModelOptions Members
Autodesk.Revit.DB.IFC Namespace